burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Include/gd32e502_syscfg.h
/* lock definitions */
#define SYSCFG_LOCK_LOCKUP                             SYSCFG_CFG2_LOCKUP_LOCK                    /*!< LOCKUP output lock */
#define SYSCFG_LOCK_SRAM_ECC_ERROR                     SYSCFG_CFG2_SRAM_ECC_ERROR_LOCK            /*!< SRAM ECC error lock */
#define SYSCFG_LOCK_LVD                                SYSCFG_CFG2_LVD_LOCK                       /*!< LVD lock */

/* TIMER external trigger definitions */
#define TIMER_ETI_TRG0                                ((uint8_t)0x00U)                             /*!< TIMER external trigger 0 */
#define TIMER_ETI_TRG1                                ((uint8_t)0x01U)                             /*!< TIMER external trigger 1 */
#define TIMER_ETI_TRG2                                ((uint8_t)0x02U)                             /*!< TIMER external trigger 2 */
#define TIMER_ETI_TRG_NONE                            ((uint8_t)0x03U)                             /*!< do not select TIMER external trigger source */

/* TIMERx break input y */
#define TIMER20_BKIN3_TRIG                            SYSCFG_TIMERINSEL_TIMER20_BKIN3_SEL          /*!< TIMER20 break input 3 selection */
#define TIMER20_BKIN2_TRIG                            SYSCFG_TIMERINSEL_TIMER20_BKIN2_SEL          /*!< TIMER20 break input 2 selection */
#define TIMER20_BKIN1_TRIG                            SYSCFG_TIMERINSEL_TIMER20_BKIN1_SEL          /*!< TIMER20 break input 1 selection */
#define TIMER20_BKIN0_TRIG                            SYSCFG_TIMERINSEL_TIMER20_BKIN0_SEL          /*!< TIMER20 break input 0 selection */
#define TIMER19_BKIN3_TRIG                            SYSCFG_TIMERINSEL_TIMER19_BKIN3_SEL          /*!< TIMER19 break input 3 selection */
#define TIMER19_BKIN2_TRIG                            SYSCFG_TIMERINSEL_TIMER19_BKIN2_SEL          /*!< TIMER19 break input 2 selection */
#define TIMER19_BKIN1_TRIG                            SYSCFG_TIMERINSEL_TIMER19_BKIN1_SEL          /*!< TIMER19 break input 1 selection */
#define TIMER19_BKIN0_TRIG                            SYSCFG_TIMERINSEL_TIMER19_BKIN0_SEL          /*!< TIMER19 break input 0 selection */
#define TIMER7_BKIN3_TRIG                             SYSCFG_TIMERINSEL_TIMER7_BKIN3_SEL           /*!< TIMER7 break input 3 selection */
#define TIMER7_BKIN2_TRIG                             SYSCFG_TIMERINSEL_TIMER7_BKIN2_SEL           /*!< TIMER7 break input 2 selection */
#define TIMER7_BKIN1_TRIG                             SYSCFG_TIMERINSEL_TIMER7_BKIN1_SEL           /*!< TIMER7 break input 1 selection */
#define TIMER7_BKIN0_TRIG                             SYSCFG_TIMERINSEL_TIMER7_BKIN0_SEL           /*!< TIMER7 break input 0 selection */
#define TIMER0_BKIN3_TRIG                             SYSCFG_TIMERINSEL_TIMER0_BKIN3_SEL           /*!< TIMER0 break input 3 selection */
#define TIMER0_BKIN2_TRIG                             SYSCFG_TIMERINSEL_TIMER0_BKIN2_SEL           /*!< TIMER0 break input 2 selection */
#define TIMER0_BKIN1_TRIG                             SYSCFG_TIMERINSEL_TIMER0_BKIN1_SEL           /*!< TIMER0 break input 1 selection */
#define TIMER0_BKIN0_TRIG                             SYSCFG_TIMERINSEL_TIMER0_BKIN0_SEL           /*!< TIMER0 break input 0 selection */

/* TIMER7 channel0 complementary input source definitions */
#define TIMER7CH0N_TIMER7CH0_TIMER0CH0_IN              SYSCFG_TIMERINSEL_TIMER7_CH0N_SEL           /*!< exclusive or of TIMER7_CH0_IN,TIMER7_CH0N_IN,and TIMER0_CH0_IN */
#define TIMER7_CH0N_IN                                 (~SYSCFG_TIMERINSEL_TIMER7_CH0N_SEL)        /*!< TIMER7_CH0N_IN */

/* SYSCFG flag definitions */
#define SYSCFG_FLAG_SRAMECCMERR                        SYSCFG_STAT_SRAMECCMEIF                     /*!< SRAM multi-bits non-correction ECC error flag */
#define SYSCFG_FLAG_SRAMECCSERR                        SYSCFG_STAT_SRAMECCSEIF                     /*!< SRAM single bit correction ECC error flag */
#define SYSCFG_FLAG_FLASHECCERR                        SYSCFG_STAT_FLASHECCIF                      /*!< FLASH ECC NMI error flag */
#define SYSCFG_FLAG_CKMNMIERR                          SYSCFG_STAT_CKMNMIIF                        /*!< HXTAL clock monitor NMI error flag */
#define SYSCFG_FLAG_NMIPINERR                          SYSCFG_STAT_NMIPINIF                        /*!< NMI pin error flag */

/* SYSCFG interrupt flag constants definitions */
#define SYSCFG_INT_FLAG_SRAMECCMERR                    SYSCFG_STAT_SRAMECCMEIF                     /*!< SRAM multi-bits non-correction ECC error interrupt flag */
#define SYSCFG_INT_FLAG_SRAMECCSERR                    SYSCFG_STAT_SRAMECCSEIF                     /*!< SRAM single bit correction ECC error interrupt flag */
#define SYSCFG_INT_FLAG_FLASHECCERR                    SYSCFG_STAT_FLASHECCIF                      /*!< FLASH ECC NMI error interrupt flag */
#define SYSCFG_INT_FLAG_CKMNMIERR                      SYSCFG_STAT_CKMNMIIF                        /*!< HXTAL clock monitor NMI error interrupt flag */
#define SYSCFG_INT_FLAG_NMIPINERR                      SYSCFG_STAT_NMIPINIF                        /*!< NMI pin error interrupt flag */

/* SYSCFG interrupt enable/disable constants definitions */
#define SYSCFG_INT_SRAMECCME                          SYSCFG_CFG3_SRAMECCMEIE                      /*!< SRAM multi-bits non-correction ECC error */
#define SYSCFG_INT_SRAMECCSE                          SYSCFG_CFG3_SRAMECCSEIE                      /*!< SRAM single bit correction ECC error */
#define SYSCFG_INT_FLASHECCE                          SYSCFG_CFG3_FLASHECCIE                       /*!< FLASH ECC NMI error */
#define SYSCFG_INT_CKMNMI                             SYSCFG_CFG3_CKMNMIIE                         /*!< receive buffer not empty interrupt */
#define SYSCFG_INT_NMIPIN                             SYSCFG_CFG3_NMIPINIE                         /*!< HXTAL clock monitor NMI error */

typedef enum {
    ADC1_IN14_REMAP = 1U,                              /*!< ADC1 channel 14 remapping */
    ADC1_IN15_REMAP,                                   /*!< ADC1 channel 15 remapping */
    ADC0_IN8_REMAP,                                    /*!< ADC0 channel 8 remapping */
    ADC0_IN9_REMAP                                     /*!< ADC0 channel 9 remapping */
} syscfg_adcx_chy_enum;

